//=================================================================
/*
    --------------------
    @   Awake vs Start
    --------------------
        -   공통점
            -   씬이 로딩된 후 최초 1회 호출됨.
            -   해당 스크립트의 초기화 작업에 사용됨.
            -   Update 함수가 호출되기 전에 호출됨.

       -    차이점
        
            ============================================================================
                                        |   Awake                      |   Start
            ============================================================================
            호출 순서                   |      1                       |   2
            ----------------------------------------------------------------------------
            호출 조건                   |  게임 오브젝트의 활성화        |   게임 오브젝트 + 스크립트의 활성화.
            ----------------------------------------------------------------------------
            Instantiate 함수로          |  Instantiate 작동 즉시        |   Awake 동작후 Update가 호출되기  
            게임 오브젝트 생성시         |  호출됨.                      |   바로 전 프레임에서 호출됨.
            호출 시점.                  |                               |
                                       |                               |
            [ InstantiateAwakeStart ]  |                               |
            ----------------------------------------------------------------------------
            코루틴 적용.                 |   불가.                       | 가능.
            [ CoroutineStart ]          |                               |
            ============================================================================

*/
//=================================================================
using UnityEngine;
//=================================================================
public class AwakeStartTest : MonoBehaviour
{
    private void Awake() {

        Debug.Log("----- " + name + " Awake -----");
    }
    //*
    private void OnEnable()
    {
        Debug.Log("//// " + name + " OnEnable ////");
    }
    //*/
    //* Start나 OnEnable를 정의 하지 않으면 인스펙터에 스크립트 체크 박스가 노출되지 않음.
    private void Start() {
        
        Debug.Log("***** " + name + " Start *****");
    }
    //*/
}
//=================================================================