//=================================================================
/*
    참고  :       https://wergia.tistory.com/117
                  https://coderzero.tistory.com/101
                  https://docs.unity3d.com/ScriptReference/MonoBehaviour.html
                  
    --------------------------
    1.  마우스 버튼 입력 처리
    --------------------------
        -   bool Input.GetMouseButtonDown(int button);
            -   버튼을 누른 순간의 상태 체크.
            bool Input.GetMouseButton(int button);
            -   버튼을 누르고 있는 상태 유지 체크.
            bool Input.GetMouseButtonUp(int button);
            -   눌렸던 버튼을 떼는 상태 체크.

            -   button
                0       :   마우스 왼쪽 버튼.
                1       :   마우스 오른쪽 버튼.
                2       :   마우스 휠 버튼.
                3 ~ 6   :   그외 마우스 추가 버튼.
        


    --------------------------
    2.  마우스 좌표 정보
    --------------------------
        -   Vector3 Input.mousePosition
            -   픽셀좌표에서의 현재 마우스 위치를 나타냄.( 읽기 전용 ).
            
            -  [ 좌표 수치. ]
                ======================================================================
                *클라이언트 영역 기준.    |       X               |     Y
                ----------------------------------------------------------------------
                좌하단                   |       0               |     0
                ----------------------------------------------------------------------
                우상단                   |       Screen.width    |     Screen.height
                ======================================================================

                * 클라이언트 영역.
                    -   개발자가 실제 작업을 할수 있는 화면 공간.


    
    --------------------------
    3.  마우스 휠 드래그.
    --------------------------
        1)  Vector2 Input.mouseScrollDelta
            -   Vector2.y 값으로 -1 또는 1이 반환됨.

        2)  float GetAxis( "Mouse ScrollWheel" )
            -   -0.1 또는 0.1이 반환됨.

        -   값이 음수라면 위로 드래그, 양수라면 아래로 드래그.        
        

    --------------------------
    4.  OnMouse
    --------------------------
        -   GUIElement 또는 Collider의 영역에서 마우스의 동작에 대한 이벤트 함수.
        ============================================================================================================
        함수				|   설명
        ------------------------------------------------------------------------------------------------------------
        OnMouseDown         |	마우스 버튼을 해당 영역에서 누른 순간 호출.
        ------------------------------------------------------------------------------------------------------------
        OnMouseDrag	        |   마우스 버튼을 계속 누르고 있는 경우에 호출.
        ------------------------------------------------------------------------------------------------------------
        OnMouseEnter    	|   마우스가 해당 영역 안으로 들어갔을 때 호출.
        ------------------------------------------------------------------------------------------------------------
        OnMouseExit	        |   마우스가 해당 영역 위에서 탈출한 경우 호출.
        ------------------------------------------------------------------------------------------------------------
        OnMouseOver	        |   마우스가 해당 영역 위에 있는 동안 매 프레임 마다 호출.
        ------------------------------------------------------------------------------------------------------------
        OnMouseUp	        |   마우스 버튼 클릭을 해제했을 때 호출.
        ------------------------------------------------------------------------------------------------------------
        OnMouseUpAsButton	|   해당 영역 위에서 마우스 버튼 클릭이 해제되었을 때에만 호출
        ============================================================================================================

*/
//=================================================================
using UnityEngine;
//=================================================================
public class GetMouseButtonTest : MonoBehaviour
{
    //*
    void OnMouseDown() { Debug.Log("OnMouseDown!!"); }
    void OnMouseDrag() { Debug.Log("OnMouseDrag!!"); }
    void OnMouseEnter() { Debug.Log("OnMouseEnter!!"); }
    void OnMouseExit() { Debug.Log("OnMouseExit!!"); }    
    void OnMouseUp() { Debug.Log("OnMouseUp!!"); }
    void OnMouseUpAsButton() { Debug.Log("OnMouseUpAsButton!!"); }
    //*/
    void OnMouseOver() { Debug.Log("OnMouseOver!!"); }

    //--------------------------
    void Update()
    {
        //-------------------
        /*  마우스 좌표 정보.
        Debug.Log("현재 마우스 좌표 : " + Input.mousePosition);
        //*/
        //-------------------    
        /*  마우스 버튼 상태 체크.
        if (Input.GetMouseButtonDown(0))
            Debug.Log("마우스 왼쪽 버튼 클릭 했습니다.");

        if (Input.GetMouseButton(0))
            Debug.Log("마우스 왼쪽 버튼이 계속 눌리고 있습니다.");

        if (Input.GetMouseButtonUp(0))
            Debug.Log("마우스 왼쪽 버튼을 눌렀다 뗐습니다.");
        //*/
        //-------------------
        /*  마우스 드래그 - 1
        float mouseWheel1 = Input.GetAxis("Mouse ScrollWheel");
        if (mouseWheel1 > 0)
        {
            Debug.Log("Drag Up!!!");
            Debug.Log("드래그 수치 : " + mouseWheel1);
        }
        else if (mouseWheel1 < 0)
        {
            Debug.Log("Drag Down!!!");
            Debug.Log("드래그 수치 : " + mouseWheel1);            
        }
        //*/
        //-------------------
        /*  마우스 드래그 - 2
        Vector2 mouseWheel2 = Input.mouseScrollDelta;
        if (mouseWheel2.y > 0)
        {
            Debug.Log("Drag Up!!!");
            Debug.Log("드래그 수치 : " + mouseWheel2.y);
        }
        else if (mouseWheel2.y < 0)
        {
            Debug.Log("Drag Down!!!");
            Debug.Log("드래그 수치 : " + mouseWheel2.y);
        }
        //*/
        //-------------------

    }// void Update()
    //--------------------------

}// public class GetMouseButtonTest : MonoBehaviour
 //=================================================================
 /*
  *  Q ) 마우스를 스크롤 하여 게임 오브젝트를 상하로 움직이도록 합니다.
 */
 //=================================================================